Repository: Zamony/linux-dev
Catalog: 10_Documenting/*.po
Languages: ru

source: Guess is a simple terminal game Usage: guess [OPTION] Options: -r enable roman number mode --help print this help, then exit --version print version number, then exit It is a simple game where you choose a number in the range [1, 100] and the computer finds it by shrinking the remaining range by the factor of two
ru: Guess - это простая игра для терминала Использование: guess [ОПЦИЯ] Опции: -r включить режим римских цифр --help напечатать это сообщение и выйти --version напечатать версию и выйти Это простая игра, где вы выбираете число в отрезке [1, 100] и компьютер угадывает его, на каждом шаге сокращая отрезок чисел вдвое

source: Choose a number in the range [I..C]
ru: Загадайте число в отрезке [1..100]

source: Choose a number in the range [1..100]
ru: Загадайте число в отрезке [1..100]

source: Is your number greater than %s? (%s/%s):
ru: Ваше число больше, чем %s? (%s/%s):

source: y
ru: д

source: n
ru: н

source: Is your number greater than %d? (%s/%s):
ru: Ваше число больше, чем %d? (%s/%s):

source: Invalid input
ru: Неправильный ввод

source: Your number is %s
ru: Ваше число - это %s

source: Your number is %d
ru: Ваше число - это %d
